Revit 2027 API
IFCUserDefinedProperty Constructor
Overload List
Name | Description
IFCUserDefinedProperty() |  Constructs a new IFCUserDefinedProperty with default values.
IFCUserDefinedProperty(String, ElementId, String, String, IFCUserDefinedPropertyType, String) |  Constructs a new IFCUserDefinedProperty with input values. The property name. The Revit property id. The Revit property name. The data type of the property. The type of the property. The defined value data type of the table property.
Top
See Also
Reference
IFCUserDefinedProperty Class
Autodesk.Revit.DB Namespace